In [90]:
import pandas as pd
import numpy as np

In [91]:
dfMale = pd.read_csv("./data/Indian-Male-Names.csv")
dfFemale = pd.read_csv("./data/Indian-Female-Names.csv")

In [92]:
dfMale.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [93]:
dfFemale.head()

              name gender    race
0          shivani      f  indian
1             isha      f  indian
2  smt shyani devi      f  indian
3            divya      f  indian
4            mansi      f  indian

In [94]:
unisexList= []

In [95]:
for x in dfMale["name"]:
    for y in dfFemale["name"]:
        if x == y: unisexList.append(y)

In [96]:
dict = {'name': unisexList, 'gender': 'u'}
dfUnisex = pd.DataFrame(dict)

In [97]:
dfUnisex

              name gender
0           sanjay      u
1             aman      u
2             aman      u
3          durgesh      u
4          durgesh      u
...            ...    ...
12513  vinod kumar      u
12514    raj kumar      u
12515         monu      u
12516       deepak      u
12517       deepak      u

[12518 rows x 2 columns]

In [99]:
dfUnisex.drop_duplicates(subset='name', keep='first')

          name gender
0       sanjay      u
1         aman      u
3      durgesh      u
7      santosh      u
61     gulshan      u
...        ...    ...
11996  tasleem      u
12025   lovely      u
12116   kalpna      u
12383   ruksar      u
12424    pinki      u

[258 rows x 2 columns]

In [104]:
dfFinal = dfMale.append([dfFemale, dfUnisex], ignore_index=True)
del dfFinal['race']

In [105]:
dfFinal

                  name gender
0              barjraj      m
1         ramdin verma      m
2      sharat chandran      m
3      birender mandal      m
4                 amit      m
...                ...    ...
42740      vinod kumar      u
42741        raj kumar      u
42742             monu      u
42743           deepak      u
42744           deepak      u

[42745 rows x 2 columns]